package lesson46;

public class Task2Star {

  /**
   * Создать словарь (Map<String, String>) занести в него записи по принципу "фамилия" - "имя".
   * Сначала количество записей, а потом фамилию и имя для каждой записи прочитать с клавиатуры.
   * Фамилия и имя будут расположены в одной строке через пробел, необходимо воспользоваться
   * методами строк (String): substring() и indexOf().
   * Удалить людей, имеющих одинаковые имена.
   * Вывести содержимое словаря (после удаления) на экран.
   *
   * @param args
   */
  public static void main(String[] args) {

  }
}
